---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotUnlockFamilyTemplate
source: html/49196371-255c-28d4-cc9b-af7508b48fb9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotUnlockFamilyTemplate Property

Can't unlock alignments from Family Template.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUnlockFamilyTemplate { get; }
```